In [ ]:
#Data.csv

**Step 1: Importing the libraries**

In [1]:

import pandas as pd
import numpy as np
%autosave 60

Autosaving every 60 seconds

**Step 2: Importing dataset**

In [3]:
data=pd.read_csv('Data.csv')
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
data.shape

(10, 4)

In [5]:
data.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [8]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
Age,9.0,38.777778,7.693793,27.0,35.0,38.0,44.0,50.0
Salary,9.0,63777.777778,12265.579662,48000.0,54000.0,61000.0,72000.0,83000.0

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

**Step 3: Handling the missing data**

In [10]:
data.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [14]:
data['Salary'].fillna(data['Salary'].median(),inplace=True)

In [19]:
data['Salary'].value_counts()

61000.0    2
72000.0    1
48000.0    1
54000.0    1
58000.0    1
52000.0    1
79000.0    1
83000.0    1
67000.0    1
Name: Salary, dtype: int64

In [17]:
data.isnull().sum()

Country      0
Age          1
Salary       0
Purchased    0
dtype: int64

In [20]:
data['Age'].fillna(data['Age'].median(),inplace=True)

In [21]:
data.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

**Step 4: Encoding categorical data**

In [23]:
from sklearn import preprocessing
data['Purchased']=data[['Purchased']].apply(preprocessing.LabelEncoder().fit_transform)

In [24]:
data

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0  61000.0          1
5   France  35.0  58000.0          1
6    Spain  38.0  52000.0          0
7   France  48.0  79000.0          1
8  Germany  50.0  83000.0          0
9   France  37.0  67000.0          1

**Step 5: Creating a dummy variable**

In [25]:
onehotencode=pd.get_dummies(data)
onehotencode

    Age   Salary  Purchased  Country_France  Country_Germany  Country_Spain
0  44.0  72000.0          0               1                0              0
1  27.0  48000.0          1               0                0              1
2  30.0  54000.0          0               0                1              0
3  38.0  61000.0          0               0                0              1
4  40.0  61000.0          1               0                1              0
5  35.0  58000.0          1               1                0              0
6  38.0  52000.0          0               0                0              1
7  48.0  79000.0          1               1                0              0
8  50.0  83000.0          0               0                1              0
9  37.0  67000.0          1               1                0              0

In [35]:
x=onehotencode.drop(columns=['Salary'])
x

    Age  Purchased  Country_France  Country_Germany  Country_Spain
0  44.0          0               1                0              0
1  27.0          1               0                0              1
2  30.0          0               0                1              0
3  38.0          0               0                0              1
4  40.0          1               0                1              0
5  35.0          1               1                0              0
6  38.0          0               0                0              1
7  48.0          1               1                0              0
8  50.0          0               0                1              0
9  37.0          1               1                0              0

In [36]:
y=onehotencode['Salary']
y

0    72000.0
1    48000.0
2    54000.0
3    61000.0
4    61000.0
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: Salary, dtype: float64

**Step 6: Splitting the datasets into training sets and Test sets**

In [38]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=5)

print("x_train shape:",x_train.shape)
print("x_test shape:",x_test.shape)
print("y_train shape:",y_train.shape)
print("y_test shape:",y_test.shape)

x_train shape: (8, 5)
x_test shape: (2, 5)
y_train shape: (8,)
y_test shape: (2,)

**Step 7: Feature Scaling**

In [39]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
x_train_scalar=scaler.fit_transform(x_train)
y_train_scalar=scaler.fit_transform(x_test)